## Learning Objectives:

* Introduction to pandas special data structure - dataframes
* How to create a DataFrame
* Working with a DataFrame

In [2]:
import pandas as pd
import numpy as np

## Creating a dataframe

In [3]:
##creating a dataframe using a dict

scores_data = {
    "Student": ["Tom", "Katey", "Mak", "Bill", "Arjun"],
    "Age": np.random.randint(20, 25, size=5),
    "sub1_score": np.random.randint(50, 75, size=5),
    "sub2_score": np.random.randint(65, 90, size=5),
}

scores_data

{'Student': ['Tom', 'Katey', 'Mak', 'Bill', 'Arjun'],
 'Age': array([20, 20, 24, 20, 24]),
 'sub1_score': array([51, 65, 51, 52, 51]),
 'sub2_score': array([74, 74, 86, 70, 75])}

In [4]:
df = pd.DataFrame(scores_data)

In [5]:
df

  Student  Age  sub1_score  sub2_score
0     Tom   20          51          74
1   Katey   20          65          74
2     Mak   24          51          86
3    Bill   20          52          70
4   Arjun   24          51          75

In [6]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
df.columns

Index(['Student', 'Age', 'sub1_score', 'sub2_score'], dtype='object')

In [8]:
df['Student']

0      Tom
1    Katey
2      Mak
3     Bill
4    Arjun
Name: Student, dtype: object

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
type(df['Student'])

pandas.core.series.Series

In [11]:
df['sub3_score'] = 0
df

  Student  Age  sub1_score  sub2_score  sub3_score
0     Tom   20          51          74           0
1   Katey   20          65          74           0
2     Mak   24          51          86           0
3    Bill   20          52          70           0
4   Arjun   24          51          75           0

In [12]:
## creating a dataframe using a 2D array

arr_2d = np.random.randint(50, 100, size=(40)).reshape(8, 5)
arr_2d

array([[97, 56, 53, 56, 57],
       [51, 87, 63, 50, 73],
       [97, 79, 79, 99, 73],
       [91, 62, 68, 82, 94],
       [77, 92, 92, 62, 80],
       [59, 86, 53, 88, 61],
       [99, 78, 71, 52, 94],
       [59, 75, 73, 86, 55]])

In [13]:
arr_df = pd.DataFrame(arr_2d)

In [14]:
arr_df

    0   1   2   3   4
0  97  56  53  56  57
1  51  87  63  50  73
2  97  79  79  99  73
3  91  62  68  82  94
4  77  92  92  62  80
5  59  86  53  88  61
6  99  78  71  52  94
7  59  75  73  86  55

In [16]:
arr_df.index

RangeIndex(start=0, stop=8, step=1)

In [17]:
arr_df = pd.DataFrame(arr_2d, columns=['sub1_score', 'sub2_score', 'sub3_score', 'sub4_score', 'sub5_score'])
arr_df

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
0          97          56          53          56          57
1          51          87          63          50          73
2          97          79          79          99          73
3          91          62          68          82          94
4          77          92          92          62          80
5          59          86          53          88          61
6          99          78          71          52          94
7          59          75          73          86          55

In [18]:
arr_df.columns

Index(['sub1_score', 'sub2_score', 'sub3_score', 'sub4_score', 'sub5_score'], dtype='object')

In [19]:
list(arr_df.columns)

['sub1_score', 'sub2_score', 'sub3_score', 'sub4_score', 'sub5_score']

In [20]:
arr_df['sub2_score']

0    56
1    87
2    79
3    62
4    92
5    86
6    78
7    75
Name: sub2_score, dtype: int64

In [22]:
arr_df.head(10)

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
0          97          56          53          56          57
1          51          87          63          50          73
2          97          79          79          99          73
3          91          62          68          82          94
4          77          92          92          62          80
5          59          86          53          88          61
6          99          78          71          52          94
7          59          75          73          86          55

In [23]:
arr_df.tail()

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
3          91          62          68          82          94
4          77          92          92          62          80
5          59          86          53          88          61
6          99          78          71          52          94
7          59          75          73          86          55

In [25]:
arr_df.sample(3)

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
2          97          79          79          99          73
7          59          75          73          86          55
6          99          78          71          52          94

In [26]:
arr_df['sub3_score'] = np.nan
arr_df

   sub1_score  sub2_score  sub3_score  sub4_score  sub5_score
0          97          56         NaN          56          57
1          51          87         NaN          50          73
2          97          79         NaN          99          73
3          91          62         NaN          82          94
4          77          92         NaN          62          80
5          59          86         NaN          88          61
6          99          78         NaN          52          94
7          59          75         NaN          86          55